In [42]:
import pandas as pd

In [43]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# display top 3 row of dataframe

In [44]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

# # display last 3 row of dataframe

In [45]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# Shape of Data frame

In [46]:
df1.shape

(7, 3)

# get info for all element of dataframe like rows cols data type

In [47]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

# Check null values

In [48]:
df1.isnull().sum(axis=1) # axis = 1 check cols otherwise rows

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

# Get overall statistics of DataFrame

In [49]:
df1.describe(include='all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

# Find unique value from Gender column

In [50]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

# Find the number of unique value from Gender column

In [51]:
df1['Gender'].nunique()

2

# Display count of unique value in gender column

In [52]:
df1['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

# Find total no: of student having marks b/w 90 to 100 using between method

In [54]:
df1[df1['Marks']>=90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [62]:
df1[(df1['Marks']>=90)  & (df1['Marks']<=100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [65]:
len(df1[(df1['Marks']>=90)  & (df1['Marks']<=100)])

4

In [68]:
sum(df1['Marks'].between(90,100))

4

# Find avg marks

In [70]:
df1['Marks'].mean()

92.14285714285714

In [71]:
df1['Marks'].min()

83

In [72]:
df1['Marks'].max()

99

# Apply Methods

In [77]:
def marks(x):
    return x//2

In [78]:
df1['half_marks'] = df1['Marks'].apply(marks)

In [79]:
df1

      Name  Marks  Gender  half_marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [80]:
df1['Marks'].apply(lambda x: x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [83]:
df1['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

# Map function

In [86]:
df1['male_female']=df1['Gender'].map({"Male":1,"Female":0})

In [87]:
df1

      Name  Marks  Gender  half_marks  male_female
0  Priyang     98    Male          49            1
1   Aadhya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

# Drop the Column

In [90]:
df1.drop('male_female',axis=1)

      Name  Marks  Gender  half_marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [92]:
df1.drop(['half_marks','male_female'],axis=1,inplace=True)

In [93]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# Print name of cols

In [94]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

# Sort the dataframe as per marks column

In [96]:
df1['Marks'].sort_values(ascending=False)

2    99
6    99
0    98
4    90
1    89
3    87
5    83
Name: Marks, dtype: int64

# Dispaly name and marks of female students

In [104]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [110]:
df1[df1['Gender']=='Female'][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [111]:
df1[df1['Gender'].isin(['Female'])]

      Name  Marks  Gender
1   Aadhya     89  Female
2   Krisha     99  Female
5   Mittal     83  Female
6  Archana     99  Female